# Entregable 1 


## Consultas DB Escuela

In [1]:
#sqlalchemy maneja pool de conexiones, ORM entre otras cosas
from sqlalchemy import create_engine
#Pandas es una libreria de procesamiento de datos, aqui la usamos para desplegar los resultados
import pandas as pd

In [2]:
#!pip install pymysql
engine = create_engine("mariadb+pymysql://WorkBen:N0m3l0n0m3l0@localhost/Escuela?charset=utf8mb4")

In [3]:
connection = engine.connect()

# Consulta 1: 
## Listar los alumnos con estatus de regular (considere que un alumno regular puede tener no aprobada como máximo una materia)

In [4]:
Q1="""select *
from estudiante
where idestudiante in (
select distinct idEstudiante 
from curso_has_estudiante
where calificacion between 6 and 10 and idEstudiante != any (-- conjunto de estudiantes con estatus irregular
                                                              select idEstudiante
						                                     from curso_has_estudiante
                                                             where calificacion < 6
                                                             group by idEstudiante
                                                             having count(*) > 1));"""

In [5]:
data=pd.read_sql_query(Q1,connection)
data

  idEstudiante          Nombre Apellido1 Apellido2
0   2019640011  Carlos Eduardo     Gómez    García
1   2019640125         Eduardo    García     López
2   2019640231         Beatriz    Torres     Parra

# Consulta 2: 
## Listar el porcentaje de no aprobados por materia en los semestres 20212 y 20221

### Solucion 1, sin usar vistas

In [6]:
Q2="""select idMateria, Semestre, sum(naprobados) / sum(inscritos) pnaprobados
from vANAProfesorMSG
where semestre = "20212" or semestre = "20221" 
group by idMateria, semestre;"""
data=pd.read_sql_query(Q2,connection)
data

  idmateria semestre  pnaprobados
0      T203    20212          1.0
1      T302    20221          1.0
2      T410    20221          NaN

### Solucion 2,usando vistas

In [7]:
Q2="""select idMateria, Semestre, sum(naprobados) / sum(inscritos) pnaprobados
from vANAProfesorMSG
where semestre = "20212" or semestre = "20221" 
group by idMateria, semestre;"""
data=pd.read_sql_query(Q2,connection)
data

  idmateria semestre  pnaprobados
0      T203    20212          1.0
1      T302    20221          1.0
2      T410    20221          NaN

# Consulta 3: 
## Listar los profesores que aprobaron a todos sus alumnos en todas sus materias

### Solución sin vista

In [8]:
Q3="""select t1.idprofesor
from (select c.idprofesor, count(*) as aprobados
      from curso c inner join curso_has_estudiante ce
      on c.semestre = ce.semestre and c.grupo = ce.grupo and c.idMateria = ce.idMateria
      where calificacion between 6 and 10
      group by c.idProfesor
     ) as t1
inner join (select c.idprofesor, count(ce.idEstudiante) as inscritos
            from curso c inner join curso_has_estudiante ce
            on c.semestre = ce.semestre and c.grupo = ce.grupo and c.idMateria = ce.idMateria
            group by c.idProfesor) as t2
 on t1.idProfesor = t2.idprofesor 
 and t1.aprobados = t2.inscritos;
 """
data=pd.read_sql_query(Q3,connection)
data

Empty DataFrame
Columns: [idprofesor]
Index: []

### Solución con vista

In [9]:
Q3="""select idprofesor
from vANAProfesorMSG
where naprobados is null and
idprofesor not in (select distinct idProfesor
                   from vANAProfesorMSG
                   where naprobados is not null );
 """
data=pd.read_sql_query(Q3,connection)
data

Empty DataFrame
Columns: [idprofesor]
Index: []

# Consulta 4: 
## Listar los profesores con el mayor porcentaje de no aprobados en los semestres 20212 y 20221

In [10]:
Q4="""select idprofesor
 from vANAProfesorMSG
 where semestre = "20212" or semestre = "20221"
 group by idprofesor 
 having sum(naprobados) / sum(inscritos) = (select max(pnaprobados)
                                            from (select idprofesor, sum(naprobados) / sum(inscritos) pnaprobados
                                                  from vANAProfesorMSG
                                                  where semestre = "20212" or semestre = "20221"
                                                  group by idprofesor) as T); """
data=pd.read_sql_query(Q4,connection)
data

  idprofesor
0   98074241

# Consulta 5
## Determinar si en la materia T302 existe un porcentaje de no aprobados entre el 30% y 50% en cada uno de sus grupos.

In [11]:
Q5="""select if ((select count(*)
           from (select idmateria, naprobados / inscritos
                 from vANAProfesorMSG
                 where idmateria = "T302") as t1) != (select count(*)
                                                      from (select idmateria, naprobados / inscritos
                                                            from vANAProfesorMSG
                                                            where idmateria = "T302" and naprobados/inscritos between 0.30 and 0.50) as t2),
		   "No todos los grupos tienen entre 30 y 50 porciento de no aprobados",
           "Todos los grupos tienen entre 30 y 50 porciento de no aprobados");"""
data=pd.read_sql_query(Q5,connection)
data

  if ((select count(*)\n           from (select idmateria, naprobados / inscritos\n                 from vANAProfesorMSG\n                 where idmateria = "T302") as t1) != (select count(*)\n                                                      from (select i
0  No todos los grupos tienen entre 30 y 50 porci...

# Consulta 6
## Listar los alumnos que han aprobado todas las asignaturas que imparte el profesor  10275287

### Opción 1

In [12]:
Q6="""select idestudiante, if (count(distinct idmateria) = (select count(distinct idmateria)
                                                      from vProfesorEstudiante
                                                      where idprofesor = "10275287"),"si","no") as "aprobaron todo" 
from vProfesorEstudiante
where idprofesor = "10275287" and calificacion between 6 and 10
group by idestudiante;
"""
data=pd.read_sql_query(Q6,connection)
data

  idEstudiante aprobaron todo
0   2019640231             si

### Opción 2

In [13]:
Q6="""select idestudiante 
from (select idestudiante, count(distinct idmateria) as maprobadas
      from vProfesorEstudiante
      where idprofesor = "10275287" and calificacion between 6 and 10
      group by idestudiante) as T1
 where maprobadas = (-- cuantas materias imparte el profesor
                     select count(distinct idmateria)
                     from vProfesorEstudiante
                     where idprofesor = "10275287");"""
data=pd.read_sql_query(Q6,connection)
data

  idestudiante
0   2019640231

#### Nota:Las consultas presentadas en este documento son las presentadas en el repositorio por  el profesor: 
Para consultarlas click en el siguiente enlace [enlace](https://github.com/cdelacruz-upiita/BDD_3TM3_2022/tree/main/practicas)